# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'sambadevi/powerlevel9k'
tap 'AdoptOpenJDK/openjdk'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'vim'
brew 'zlib' # Needed for Memcached
brew 'powerlevel9k' # https://github.com/Powerlevel9k/powerlevel9k/wiki/Install-Instructions#macos-with-homebrew
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'z'
 # Configure gpg: Start
brew 'gnupg' 
brew 'pinentry-mac'
# Configure gpg: End
# https://develotters.com/posts/terminal-fun-basic-utils/
brew 'exa'
brew 'git-delta'

# Apps
cask 'iterm2'
cask 'lastpass'
cask 'docker'
cask 'firefox'
cask 'postman'
cask 'slack'
cask 'atom'
cask 'dropbox'
cask 'keybase'
cask 'visual-studio-code'
cask 'adoptopenjdk'
cask 'adoptopenjdk8'
cask 'adoptopenjdk11'
cask 'adoptopenjdk14'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-hack-nerd-font'


# Mac App Store. Use `mas search {keyword}` to find product id
mas 'Magnet', id: 441258766
mas 'Monosnap', id: 540348655